Revit.Elements.Dimension
Dimension element

Revit.Elements.Dimension.InternalRevitElement
Internal reference to the Revit Element

Revit.Elements.Dimension.InternalElement
Reference to the Element

Revit.Elements.Dimension.InternalSetElement(Autodesk.Revit.DB.Dimension)
Set the internal Element, ElementId, and UniqueId
wall:

Revit.Elements.Dimension.#ctor(Autodesk.Revit.DB.Dimension)
Dimension from existing
element:

Revit.Elements.Dimension.#ctor(Autodesk.Revit.DB.View,Autodesk.Revit.DB.Line,Autodesk.Revit.DB.ReferenceArray,System.String,System.String)
Dimension by Elements
view:
line:
references:
suffix:
prefix:

Revit.Elements.Dimension.InitElement(Autodesk.Revit.DB.Dimension)
Init from existing
element:

Revit.Elements.Dimension.Init(Autodesk.Revit.DB.View,Autodesk.Revit.DB.Line,Autodesk.Revit.DB.ReferenceArray,System.String,System.String)
Init by Elements
view:
line:
references:
suffix:
prefix:

Revit.Elements.Dimension.ByElements(Revit.Elements.Views.View,System.Collections.Generic.IEnumerable{Revit.Elements.Element},Autodesk.DesignScript.Geometry.Line,System.String,System.String)
Construct a Revit Dimension from at least two elements
view: View to place dimension in
referenceElements: Elements to dimension
line: location of the dimension
suffix: Suffix
prefix: Prefix
Returns: Dimension

Revit.Elements.Dimension.Value
Get Dimension Value

Revit.Elements.Dimension.Prefix
Get Prefix

Revit.Elements.Dimension.SetPrefix(System.Collections.Generic.IEnumerable{System.String})
Set Prefix
values: Prefix

Revit.Elements.Dimension.Suffix
Get Suffix

Revit.Elements.Dimension.SetSuffix(System.Collections.Generic.IEnumerable{System.String})
Set Suffix
values: Suffix

Revit.Elements.Dimension.ValueOverride
Get Value override

Revit.Elements.Dimension.SetValueOverride(System.Collections.Generic.IEnumerable{System.String})
Set Value override
values: Value override

Revit.Elements.Dimension.FromExisting(Autodesk.Revit.DB.Dimension,System.Boolean)
From existing element
instance:
isRevitOwned:
Returns:

Revit.Elements.Dimension.GetMidpoint(Autodesk.Revit.DB.BoundingBoxXYZ)
GetMidpoint from bounding box
box:
Returns: